[
  "Astronauts say the airlock smells like hot metal and seared steak. Yeah, space basically smells like a burnt frying pan. Romantic, right?",
  "Olympus Mons on Mars is the tallest volcano in the solar system, about three times taller than Everest.",
  "Voyager 1, launched in 1977, is now in interstellar space and still sending data with less computing power than a smartphone.",
  "Venus has an atmosphere full of sulfuric acid, surface temperatures hot enough to melt lead, and metallic rain.",
  "The Milky Way is on a collision course with the Andromeda galaxy in about 4.5 billion years.",
  "A day on Mercury (one rotation) lasts longer than its year (one orbit).",
  "Black holes are extremely dense objects that warp time so much that someone falling in appears frozen at the event horizon.",
  "Sagittarius B2, a giant cloud near the center of the galaxy, contains enough ethyl alcohol for 400 trillion pints of beer.",
  "The Sun holds 99.86% of all the mass in the solar system.",
  "UY Scuti is one of the largest known stars and could engulf orbits up to Mars if placed at the center of our solar system.",
  "Rogue planets drift through space without a star, possibly still having internal heat and oceans.",
  "The Eridanus Supervoid is roughly one billion light-years across and so empty that some scientists speculate it may relate to physics we don't fully understand.",
  "Saturn's rings are slowly disappearing and will likely vanish in about 100 million years as the ring material falls into the planet.",
  "The exoplanet HD 189733b experiences sideways rain made of molten glass and winds over 5,000 mph.",
  "Time runs slower near massive objects due to gravitational time dilation, so astronauts age slightly faster than people on Earth.",
  "Jupiter's Great Red Spot is a storm that has been raging for at least 350 years and possibly far longer.",
  "The Boomerang Nebula is the coldest known place in the universe at around –272°C, just one degree above absolute zero.",
  "Stars create pressure waves that can be converted into sound-like patterns, which means they 'sing' in a measurable way.",
  "A teaspoon of neutron-star material would weigh more than Mount Everest due to its extreme density.",
  "A rogue black hole is drifting through the Milky Way, detected by its gravitational effects despite having no companion star.",
  "The universe contains more stars than there are grains of sand on every beach on Earth — roughly 10^24 stars."
]
